# AlreadyWatched Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyMonitorFailures..::..AlreadyWatched Property
BuiltInFailures..::..CopyMonitorFailures Class See Also
---
Elements already monitored.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AlreadyWatched { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AlreadyWatched As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AlreadyWatched {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyMonitorFailures Class
Autodesk.Revit.DB Namespace